/*------------------------------------------------
【程序设计】
--------------------------------------------------

题目:求满足指定条件的所有三位整数存储在一维整型数组data中：
(1)该三位整数是某一个二位数的平方；
(2)该三位数的个位、十位和百位数各不相同。
*********Begin**********和**********  End  **********不可删除




*/
#include<stdio.h>
int main()
{
	FILE *outf;				  /*系统判分使用*/
	int i,data[20],count=0;   /*count用来统计满足指定条件的所有三位数的个数*/

	/**********  Begin  **********/
	for (i = 100; i <= 999; i++)
	{
		if (i % 10 != (i/10%10) && i % 10 != i / 100 && (i/10%10) != i / 100)
		{
			int j = 0;
			for (j = 10; j <= 99; j++)
			{
				if (i == (j * j))
					data[count++] = i;
			}
		}
	}
	/**********   End   **********/

	for(i=0;i<count;i++)
		printf("%d  ",data[i]);
	printf("\n");

	/*此处将结果输出到文件"bc02.in"，请勿改动，否则影响判分*/
     outf=fopen("bc02.in","w");
     for(i=0;i<count;i++)
		fprintf(outf,"%d  ",data[i]);
	fprintf(outf,"\n");
	 fclose(outf);
	 return 0;
}