/*------------------------------------------------
【程序设计】
--------------------------------------------------

题目:求n阶乘倒数和并输出

具体要求如下：

（1）	函数
 	    int process(int n); 求n的阶乘	 	
（2）	主函数
        输入n，调用函数求n阶乘倒数和,输出结果,结果保留三位小数

如：输入4，结果为1/1!+1/2!+1/3!+1/4!=1.708
*********Begin**********和**********  End  **********不可删除



		
*/
#include<stdio.h>
int process(int n)
{
/**********  Begin  **********/
	int i = 0;
	int mul = 1;
	for (i = 2; i <= n; i++)
	{
		mul *= i;
	}
	return mul;
/**********   End   **********/
}
int main()
{
	double sum=0;
	int i;
	FILE *outf;      /*系统判分使用*/

	for(i=1;i<=4;i++)
		sum=sum+1.0/process(i);

	printf("1/1!+1/2!+1/3!+1/4!=%.3lf\n",sum);

	/*此处将结果输出到文件"bc01.in"，请勿改动，否则影响判分*/
     outf=fopen("bc01.in","w");
     fprintf(outf,"1/1!+1/2!+1/3!+1/4!=%.3lf\n",sum);
	 fclose(outf);
	 return 0;
}